# NanoRoute Settings:
setNanoRouteMode -envResistanceFromCapTable true
setNanoRouteMode -quiet -routeInsertAntennaDiode 1
setNanoRouteMode -quiet -routeBottomRoutingLayer default
setNanoRouteMode -quiet -drouteEndIteration default
setNanoRouteMode -quiet -routeWithTimingDriven true
setNanoRouteMode -quiet -routeWithSiDriven false

# Route design:
routeDesign -globalDetail

# Optimize Design setup AND hold:
optDesign -postRoute -outDir reports/timing
optDesign -postRoute -hold -outDir reports/timing

# Analyze Power:
set_power_analysis_mode -method static -analysis_view tt -corner max -create_binary_db true -write_static_currents true -honor_negative_energy true -ignore_control_signals true
set_power_output_dir reports/power
set_default_switching_activity -input_activity 0.2 -period 1.2
set_powerup_analysis -mode accurate -ultrasim_simulation_mode ms
report_power -rail_analysis_format VS -outfile reports/power/PE_top.rpt

# Save the Design:
saveDesign designs/PE_top_sc_opt_routed.enc
