###################################################################

# Created by write_sdc on Fri Jul 10 16:00:50 2015

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_area 0
create_clock [get_ports clk]  -name CLOCK  -period 1.1  -waveform {0 0.55}

# additional wire delay: 0.01
set_input_delay -clock CLOCK  -max 0.32  [get_ports {operand_in_l operand_in_t operand_in_r operand_in_b}]
set_output_delay -clock CLOCK  -max 0.68  [get_ports {operand_out_l operand_out_t operand_out_r operand_out_b}]
