#saif_map -start

# map to target technology:
#compile -exact_map
#ungroup -start_level 2 -all
#compile_ultra -no_autoungroup
compile_ultra
#-scan

change_names -rules verilog -hierarchy

# write mapped .ddc file:
write -hierarchy -format ddc -output ${PROJECT_PATH}/syn/mapped/${TOP_LEVEL_MODULE}.ddc

# export mapped design as verilog netlist file for gate-level simulation:
write -hierarchy -format verilog -output ${PROJECT_PATH}/syn/netlist/${TOP_LEVEL_MODULE}_gl.v

# export timing annotations:
write_sdf ${PROJECT_PATH}/syn/mapped/${TOP_LEVEL_MODULE}_timing.sdf
write_sdc ${PROJECT_PATH}/syn/mapped/${TOP_LEVEL_MODULE}_timing.sdc
