#################################
# REPORT ABOUT THE DESIGN
#################################

report_design           > reports/${TOP_LEVEL_MODULE}_design.txt
report_timing           > reports/${TOP_LEVEL_MODULE}_timing.txt
report_power            > reports/${TOP_LEVEL_MODULE}_power.txt
report_area             > reports/${TOP_LEVEL_MODULE}_area.txt
report_reference        > reports/${TOP_LEVEL_MODULE}_reference.txt
report_resources        > reports/${TOP_LEVEL_MODULE}_resources.txt
